malbanGit/ESP32_P4_Vectrex/main/main.c
typedef struct {
    int16_t x0;
    int16_t y0;
    int16_t x1;
    int16_t y1;
    uint8_t brightness;
    uint32_t color; // 
    uint8_t  _pad[3];
} vectrex_line_t; // power of 2 length

typedef struct {
    vectrex_line_t      lines[MAX_LINE_BUFFER]; // these are the "new" lines - that will be drawn by the renderer
    int                 line_count;
    uint32_t            hash;
    volatile frame_state_t state;
} frame_slot_t;

typedef struct { int bx0, by0, bx1, by1; } line_bbox_t;

// Diese beschreiben, was aktuell in jedem Hardware-Framebuffer gezeichnet ist
DRAM_ATTR static vectrex_line_t s_fb_lines[NUM_FB][MAX_LINE_BUFFER]; // these are the last drawn lines by the renderer - used to undraw!
DRAM_ATTR static int            s_fb_line_count[NUM_FB] = {0};
DRAM_ATTR static uint8_t     s_diff_old_matched[MAX_LINE_BUFFER];
DRAM_ATTR static uint8_t     s_diff_new_matched[MAX_LINE_BUFFER];
DRAM_ATTR static uint8_t     s_diff_damaged[MAX_LINE_BUFFER];
DRAM_ATTR static line_bbox_t s_diff_dirty_bboxes[MAX_LINE_BUFFER];

// ----------------------------------------------------
// Emulator frame storage (independent of framebuffers)
// ----------------------------------------------------

// Drei logische Frames als Ringpuffer
DRAM_ATTR static frame_slot_t s_frames[NUM_FRAME_SLOTS]; // 3 frames
DRAM_ATTR static int          s_build_frame_index = 0;   // Slot, in den der Emulator gerade schreibt

/* ── Palettised overlay (draw optimisation) ───────────────────────────────── *
 * s_overlay_pal: 1 byte/pixel covering the active image region only (PSRAM).
 *   bit 7 = 1 → drawable pixel; palette index in bits 6..0
 *   bit 7 = 0 → skip (transparent or opaque after alphaAdjust)
 * s_overlay_palette: BGR table in DRAM — stays in L1 cache permanently.
 * Built once at load time with the then-current alphaAdjust.              */
uint8_t       *s_overlay_pal = NULL;
DRAM_ATTR uint8_t  s_overlay_palette[128][3];
DRAM_ATTR uint8_t  s_overlay_palette_yuv[128][3];    /* {Y, U, V} full-range for YUV draw */
DRAM_ATTR uint8_t  s_overlay_palette_yuv_ea[128][3]; /* {Y, U, V} ea-scaled for YUV undraw */

DRAM_ATTR int      s_overlay_pal_n   = 0;
DRAM_ATTR int      s_ov_off_x = 0;             /* active region x offset   */
DRAM_ATTR int      s_ov_off_y = 0;             /* active region y offset   */
DRAM_ATTR int      s_ov_w     = 0;             /* active region width      */
DRAM_ATTR int      s_ov_h     = 0;             /* active region height     */

// ----------------------------------------------------
// Per-framebuffer line storage for undraw (Hardware-FBs)
// ----------------------------------------------------

/* Task stacks pinned to internal SRAM so function calls never touch PSRAM. */
#define EMU_STACK_SIZE  (8192+4096)
#define REND_STACK_SIZE (8192+4096)
static StackType_t  s_emu_stack[EMU_STACK_SIZE];
static DRAM_ATTR StaticTask_t s_emu_tcb;
static StackType_t  s_rend_stack[REND_STACK_SIZE];
static DRAM_ATTR StaticTask_t s_rend_tcb;

// ----------------------------------------------------
// Framebuffer / display (2 Hardware-FBs)
// ----------------------------------------------------
DRAM_ATTR static uint8_t            *s_framebuffers[NUM_FB] = { NULL, NULL };
DRAM_ATTR static uint8_t            *s_fb_front             = NULL;  // aktuell angezeigt
DRAM_ATTR static uint8_t            *s_fb_back              = NULL;  // Zeichenziel
DRAM_ATTR static int                s_front_fb_index       = 0;     // Index in s_framebuffers[]
DRAM_ATTR static int                s_back_fb_index        = 1;
DRAM_ATTR static esp_lcd_panel_handle_t panel_handle = NULL;

DRAM_ATTR static esp_lcd_panel_lt8912b_io_t lt_io = {0};


// Diagnostic: 1 = output the P4 DPI's built-in vertical color bars instead of our
// frame buffer. Rules out a black/buggy frame buffer and tests the exact
// P4 DPI -> DSI -> bridge -> LVDS data path with known-good pixels. 0 = normal.
// #define VIDEO_DPI_TEST_PATTERN  1

DRAM_ATTR static esp_lcd_panel_handle_t s_dpi_panel = NULL;
DRAM_ATTR static SemaphoreHandle_t      s_vsync_sem = NULL;
DRAM_ATTR int mode = VIDEO_OUT_SELECTED;          // default at boot
DRAM_ATTR int overlayEnabled = ENABLE_OVERLAYS;          // default at boot

// helper "c" files - that are included, instead of own objects
#include "gpio.i"
#include "adc2_oneshot.i"
#include "audio.i"
#include "sdcard.i"
#include "usb.i"
#ifdef BLUETOOTH_ENABLED
    #include "bt_joy.i"
#endif

#include "file.i"
#include "esp_events.i"
#include "overlay.i"

// helper functions for optimizing line draws
// these are used to check whether lines intersect
static inline line_bbox_t line_compute_bbox(const vectrex_line_t *l)
{
    int Rb = g_line_Rb;
    line_bbox_t b;
    b.bx0 = (l->x0 < l->x1 ? l->x0 : l->x1) - Rb;
    b.bx1 = (l->x0 > l->x1 ? l->x0 : l->x1) + Rb;
    b.by0 = (l->y0 < l->y1 ? l->y0 : l->y1) - Rb;
    b.by1 = (l->y0 > l->y1 ? l->y0 : l->y1) + Rb;
    return b;
}
static inline int bboxes_overlap(const line_bbox_t *a, const line_bbox_t *b)
{
    return a->bx0 <= b->bx1 && a->bx1 >= b->bx0 &&
           a->by0 <= b->by1 && a->by1 >= b->by0;
}

// ----------------------------------------------------
// VSYNC callback
// renderer task is synchronized with VSYNC
// ----------------------------------------------------
IRAM_ATTR static bool lcd_on_refresh_done_cb(esp_lcd_panel_handle_t panel,
                                             esp_lcd_dpi_panel_event_data_t *edata,
                                             void *user_ctx)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(s_vsync_sem, &xHigherPriorityTaskWoken);
    return (xHigherPriorityTaskWoken == pdTRUE);
}

// a line draw - ONE
// used to draw and undraw (undraw brightness = 0)
// at the moment a few different line-draws are possible
// all YUV
IRAM_ATTR static inline void undrawLine_raw_color(int x0, int y0, int x1, int y1, uint8_t colorPaletteEntry, uint8_t brightness)
{
    int b = brightness+brightnessAdjust;
    undraw_line_yuv422_color(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, colorPaletteEntry, b);
}
IRAM_ATTR static inline void drawLine_raw_color(int x0, int y0, int x1, int y1, uint8_t colorPaletteEntry, uint8_t brightness)
{
    int b = brightness+brightnessAdjust;
    draw_line_yuv422_color(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, colorPaletteEntry, b);
}
IRAM_ATTR static inline void undrawLine_raw(int x0, int y0, int x1, int y1, uint8_t brightness)
{
    int b = brightness+brightnessAdjust;
    if ((x0==x1) && (y0==y1))
    {
        b += 200;
        _changeGlobalLineValues(g_line_width+0, g_line_glow+1);
        if (s_overlay == NULL)
        {
            undraw_line_yuv422_brightness(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b);
        }
        else        
        {
            undraw_line_yuv422_overlay(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b, s_overlay);
        }
        _changeGlobalLineValues(g_line_width-0, g_line_glow-1);
        return;
    }
    if (s_overlay == NULL)
    {
        undraw_line_yuv422_brightness(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b);
    }
    else        
    {
        undraw_line_yuv422_overlay(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b, s_overlay);
    }
}
IRAM_ATTR static inline void drawLine_raw(int x0, int y0, int x1, int y1, uint8_t brightness)
{
    if (brightness == 0)  return;
    int b = brightness+brightnessAdjust;

    if ((x0==x1) && (y0==y1))
    {
        b += 200;
        _changeGlobalLineValues(g_line_width+0, g_line_glow+1);

        if (s_overlay == NULL)
        {
            draw_line_yuv422_brightness(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b);
        }
        else
        {
            draw_line_yuv422_overlay(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b, s_overlay);
        }
        _changeGlobalLineValues(g_line_width-0, g_line_glow-1);


        return;
    }
    if (s_overlay == NULL)
    {
        draw_line_yuv422_brightness(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b);
    }
    else
    {
        draw_line_yuv422_overlay(s_fb_back, LCD_H_RES, LCD_V_RES, x0, y0, x1, y1, b, s_overlay);
    }
}

// ----------------------------------------------------
// LCD init
// ----------------------------------------------------

// Laurents init, taken from hdmi demo "hdmi_lt8912b_main.c"

// VCV_NOE asserted = SN74AVC4T245 translator on (I2S + HPD). Harmless for video,
// kept consistent and needed later for I2S/HPD.
static void board_assert_vcv_noe(void)
{
    gpio_set_level(BOARD_PIN_VCV_NOE, 0);   // pre-load latch before enabling driver
    gpio_config_t io = {
        .mode = GPIO_MODE_OUTPUT,
        .pin_bit_mask = 1ULL << BOARD_PIN_VCV_NOE,
    };
    ESP_ERROR_CHECK(gpio_config(&io));
    ESP_LOGI(TAG, "VCV_NOE asserted (level translator on)");
}

// VDD_MIPI_DPHY must be 2.5 V; on the P4 it comes from internal LDO_VO3.
static void board_enable_dsi_phy_power(void)
{
    esp_ldo_channel_handle_t phy_ldo = NULL;
    esp_ldo_channel_config_t cfg = {
        .chan_id = 3,            // LDO_VO3 -> VDD_MIPI_DPHY
        .voltage_mv = 2500,
    };
    ESP_ERROR_CHECK(esp_ldo_acquire_channel(&cfg, &phy_ldo));
    ESP_LOGI(TAG, "MIPI DSI D-PHY power on (2.5 V)");
}

static const char *mode_name(int m) { return m == VIDEO_OUT_LVDS ? "LVDS" : "HDMI"; }

// HDMI Hot-Plug Detect: LT8912B main bank reg 0xC1 bit7 = sink connected (5 V on HPD).
// Same read the driver's internal get_hpd does; we poll it directly off the main io.
static bool hdmi_hpd_present(const esp_lcd_panel_lt8912b_io_t *io)
{
    uint8_t data = 0;
    if (esp_lcd_panel_io_rx_param(io->main, 0xc1, &data, 1) != ESP_OK) return false;
    return (data & 0x80) != 0;
}
// Füllt einen YUV422-Framebuffer komplett mit Y=0 (schwarz) und U=V=128 (neutral/grau).
// Nutzt 32-Bit-Writes für maximale Schreibgeschwindigkeit (ein Store deckt ein
// komplettes Pixelpaar ab, statt 4 Einzel-Byte-Writes).
static void init_yuv422_framebuffer(uint8_t *fb, int width, int height)
{
    // Pattern pro Pixelpaar: Y0=0x00, U=0x80, Y1=0x00, V=0x80
    // Als little-endian uint32_t (ESP32 ist little-endian):
    const uint32_t pattern = 0x80008000u;

    size_t num_pairs = ((size_t)width * height) / 2;
    uint32_t *p32 = (uint32_t *)fb;

    for (size_t i = 0; i < num_pairs; ++i) {
        p32[i] = pattern;
    }
}
// Bring up the selected output, allocate the frame buffer, draw the test card.
static esp_err_t video_start(int mode, bool yuv422,
                             const esp_lcd_panel_lt8912b_io_t *io, esp_lcd_dsi_bus_handle_t dsi,
                             esp_lcd_panel_handle_t *panel, int *w, int *h)
{
    static const char *TAG = "video";

    esp_err_t err = (mode == VIDEO_OUT_LVDS)
                    ? lvds_start(io, dsi, yuv422, panel, w, h)
                    : hdmi_start(io, dsi, yuv422, panel, w, h);
    if (err != ESP_OK) return err;
    if (mode == VIDEO_OUT_HDMI) lvds_backlight(false,1023);   // LVDS panel unused -> backlight off

    esp_err_t err2 = esp_lcd_dpi_panel_get_frame_buffer(
        *panel,
        2,
        (void **)&s_framebuffers[0],
        (void **)&s_framebuffers[1]
    );
    if (err2 != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to get framebuffer: %s", esp_err_to_name(err2));
        return err2;
    }
    if (s_framebuffers[0] == NULL)
    {
        ESP_LOGE(TAG, "Failed to get framebuffer 0");
        return err2;
    }
    if (s_framebuffers[1] == NULL)
    {
        ESP_LOGE(TAG, "Failed to get framebuffer 1");
        return err2;
    }

    if (err2 == ESP_OK &&
        s_framebuffers[0] != NULL &&
        s_framebuffers[1] != NULL)
    {
        s_fb_front       = s_framebuffers[0];
        s_fb_back        = s_framebuffers[1];
        s_front_fb_index = 0;
        s_back_fb_index  = 1;

        if (yuv422)
        {
            init_yuv422_framebuffer(s_fb_front,*w,*h);
            init_yuv422_framebuffer(s_fb_back,*w,*h);
        }
        else
        {
            memset(s_fb_front, 0x00, (*w) * (*h) * sizeof(uint8_t)*VIDEO_FB_BPP);
            memset(s_fb_back,  0x00, (*w) * (*h) * sizeof(uint8_t)*VIDEO_FB_BPP);
        }


