malbanGit/ESP32_P4_Vectrex/main/main.c
        ESP_LOGI(TAG, "HW double buffer: FB0=%p FB1=%p", s_framebuffers[0], s_framebuffers[1]);
    }
    else
    {
        ESP_LOGI(TAG, "ERROR Allocating double buffer!\n");
    }

    ESP_LOGI(TAG, "%s up: test card %dx%d (%s)", mode_name(mode), *w, *h, yuv422 ? "YUV422" : "RGB888");

    #if LVDS_SETTLE_SWEEP
    if (mode == VIDEO_OUT_LVDS) lvds_sweep_settle(io);   // diagnostic: find the right settle
    #endif

    return ESP_OK;
}

// Tear down the current output so the other one can be brought up cleanly.
static void video_stop(esp_lcd_panel_handle_t panel)
{
    // also frees the framebuffers
    if (panel) esp_lcd_panel_del(panel);   // also deletes the inner DPI panel
    s_fb_front       = NULL;
    s_fb_back        = NULL;
}

static void lcd_deinit(void)
{
    // 1. Unregister VSYNC callback first — prevents callbacks firing
    //    during teardown.
    if (s_dpi_panel) {
        esp_lcd_dpi_panel_event_callbacks_t cbs = {
            .on_refresh_done     = NULL,
            .on_color_trans_done = NULL,
        };
        esp_lcd_dpi_panel_register_event_callbacks(s_dpi_panel, &cbs, NULL);
    }

    // 2. Turn display off.
    if (s_dpi_panel) {
        esp_lcd_panel_disp_on_off(s_dpi_panel, false);
    }

    // 3. Delete the panel (DPI panel, created inside video_start).
    if (panel_handle) {
        video_stop(panel_handle);
        panel_handle = NULL;
        s_dpi_panel  = NULL;
    }
    s_fb_front = NULL; s_fb_back = NULL;
    // 4. Delete the DSI bus (releases MIPI PHY + lane config).
    if (dsi_bus) {
        esp_lcd_del_dsi_bus(dsi_bus);
        dsi_bus = NULL;
    }

    // 5. Delete the three LT8912B I2C panel IOs.
    if (lt_io.main)    { esp_lcd_panel_io_del(lt_io.main);    lt_io.main    = NULL; }
    if (lt_io.cec_dsi) { esp_lcd_panel_io_del(lt_io.cec_dsi); lt_io.cec_dsi = NULL; }
    if (lt_io.avi)     { esp_lcd_panel_io_del(lt_io.avi);     lt_io.avi     = NULL; }

    // 6. Delete the VSYNC semaphore.
    if (s_vsync_sem) {
        vSemaphoreDelete(s_vsync_sem);
        s_vsync_sem = NULL;
    }

    ESP_LOGI(TAG, "LCD deinitialized");
}

static void lcd_init(void)
{
    ESP_LOGI(TAG, "Create VSYNC semaphore");
    s_vsync_sem = xSemaphoreCreateBinary();
    configASSERT(s_vsync_sem);

    // 2) The three LT8912B I2C register banks (main / cec-dsi / avi).
    esp_lcd_panel_io_i2c_config_t io_main_cfg = LT8912B_IO_CFG(LT8912B_I2C_HZ, LT8912B_IO_I2C_MAIN_ADDRESS);
    esp_lcd_panel_io_i2c_config_t io_cec_cfg  = LT8912B_IO_CFG(LT8912B_I2C_HZ, LT8912B_IO_I2C_CEC_ADDRESS);
    esp_lcd_panel_io_i2c_config_t io_avi_cfg  = LT8912B_IO_CFG(LT8912B_I2C_HZ, LT8912B_IO_I2C_AVI_ADDRESS);
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_bus, &io_main_cfg, &lt_io.main));
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_bus, &io_cec_cfg,  &lt_io.cec_dsi));
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_bus, &io_avi_cfg,  &lt_io.avi));

    // 3) MIPI-DSI bus (2 lanes, 1000 Mbps/lane).
/*
    #define LT8912B_PANEL_BUS_DSI_2CH_CONFIG_LCD()               \
    {                                                    \
        .bus_id = 0,                                     \
        .num_data_lanes = 2,                             \
        .phy_clk_src = 0,                                \
        .lane_bit_rate_mbps = 720,                      \
    }
    #define LT8912B_PANEL_BUS_DSI_2CH_CONFIG_HDMI()               \
    {                                                    \
        .bus_id = 0,                                     \
        .num_data_lanes = 2,                             \
        .phy_clk_src = 0,                                \
        .lane_bit_rate_mbps = 1200,                      \
    }
    if (mode == VIDEO_OUT_LVDS)
    {
        esp_lcd_dsi_bus_config_t dsi_bus_cfg = LT8912B_PANEL_BUS_DSI_2CH_CONFIG_LCD();
        ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&dsi_bus_cfg, &dsi_bus));
    }
    else
    {
        esp_lcd_dsi_bus_config_t dsi_bus_cfg = LT8912B_PANEL_BUS_DSI_2CH_CONFIG_HDMI();
        ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&dsi_bus_cfg, &dsi_bus));
    }
*/

    if (mode == VIDEO_OUT_HDMI)
    {
        if (!hdmi_hpd_present(&lt_io))
        {
            mode = VIDEO_OUT_LVDS;
        }
    }

    esp_lcd_dsi_bus_handle_t dsi_bus = NULL;
    esp_lcd_dsi_bus_config_t dsi_bus_cfg = LT8912B_PANEL_BUS_DSI_2CH_CONFIG();
    if (mode == VIDEO_OUT_LVDS)
        dsi_bus_cfg.lane_bit_rate_mbps = BOARD_DSI_LANE_MBPS;   // single source: board.h
    else
        dsi_bus_cfg.lane_bit_rate_mbps = 1200;   // single source: custom

    ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&dsi_bus_cfg, &dsi_bus));

    const bool yuv422 = VIDEO_FB_YUV422; // 
    panel_handle = NULL;
    int w,h;
    ESP_ERROR_CHECK(video_start(mode, yuv422, &lt_io, dsi_bus, &panel_handle, &w, &h));

    LCD_H_RES = w;
    LCD_V_RES = h;
    s_dpi_panel = panel_handle;

    // Register VSYNC callback
    esp_lcd_dpi_panel_event_callbacks_t cbs = {
        .on_refresh_done     = lcd_on_refresh_done_cb,
        .on_color_trans_done = NULL,
    };
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_register_event_callbacks(s_dpi_panel, &cbs, NULL));

    ESP_LOGI(TAG, "LCD initialized");
}

// ----------------------------------------------------
// Frames initialisieren (logische Frame-Slots)
// ----------------------------------------------------
static void frames_init(void)
{
    for (int i = 0; i < NUM_FRAME_SLOTS; ++i) {
        s_frames[i].line_count = 0;
        s_frames[i].hash       = 0;
        s_frames[i].state      = FRAME_FREE;
    }
    s_build_frame_index      = 0;
    s_frames[0].state        = FRAME_BUILDING;
    for (int i = 0; i < NUM_FB; ++i) 
        s_fb_line_count[i] = 0;

}

void clearFramebuffers()
{
    frames_init();
    for (int i=0;i<NUM_FB;i++) s_fb_line_count[i]=0;

    #if VIDEO_FB_YUV422
        init_yuv422_framebuffer(s_fb_front, LCD_H_RES, LCD_V_RES);
        init_yuv422_framebuffer(s_fb_back, LCD_H_RES, LCD_V_RES);
    #else
        memset(s_fb_front, 0x00, (LCD_H_RES) * (LCD_V_RES) * sizeof(uint8_t)*VIDEO_FB_BPP);
        memset(s_fb_back,  0x00, (LCD_H_RES) * (LCD_V_RES) * sizeof(uint8_t)*VIDEO_FB_BPP);
    #endif
}

// ----------------------------------------------------
// Emulator-side API
// ----------------------------------------------------
// when in color mode
// color from palette 127
// color = 0 -> undraw
IRAM_ATTR void mini_draw_line_color(int x0, int y0, int x1, int y1, int color, uint8_t brightness)
{
    int idx = s_build_frame_index;
    frame_slot_t *fs = &s_frames[idx];

    if (fs->state != FRAME_BUILDING) {
        // Slot ist nicht im BUILDING-Zustand – dann nichts schreiben
        return;
    }

    if (fs->line_count < MAX_LINE_BUFFER) 
    {
        vectrex_line_t *l = &fs->lines[fs->line_count++];
        if (mode == VIDEO_OUT_HDMI)
        {
            l->x0 = x0;
            l->y0 = y0;
            l->x1 = x1;
            l->y1 = y1;
        }
        else
        {
            /* 90° CW rotation for portrait LCD: (x,y) → (y, -x) */
            l->x0 =  LCD_H_RES-y0;  l->y0 = x0;
            l->x1 =  LCD_H_RES-y1;  l->y1 = x1;
        }

        l->brightness = brightness;
        l->color = color;
    }
    else {
        // Buffer voll – zusätzliche Linien werden verworfen
        // Optional: Debug-Ausgabe
        // printf("Emulation Exceeded line Count!!! (%d)\n", fs->line_count);
    }
}

// Emulator calls this for each line in the CURRENT emulated frame
IRAM_ATTR void mini_draw_line(int x0, int y0, int x1, int y1, uint8_t brightness)
{
    int idx = s_build_frame_index;
    frame_slot_t *fs = &s_frames[idx];

    if (fs->state != FRAME_BUILDING) {
        // Slot ist nicht im BUILDING-Zustand – dann nichts schreiben
        printf("No Building frame!");
        return;
    }

    if (fs->line_count < MAX_LINE_BUFFER) 
    {
        vectrex_line_t *l = &fs->lines[fs->line_count++];
        if (mode == VIDEO_OUT_HDMI)
        {
            l->x0 = x0;
            l->y0 = y0;
            l->x1 = x1;
            l->y1 = y1;
        }
        else
        {
            /* 90° CW rotation for portrait LCD: (x,y) → (y, -x) */
            l->x0 =  LCD_H_RES-y0;  l->y0 = x0;
            l->x1 =  LCD_H_RES-y1;  l->y1 = x1;
        }

        l->brightness = brightness;
    }
    else {
        // Buffer voll – zusätzliche Linien werden verworfen
        // Optional: Debug-Ausgabe
        //printf("Emulation Exceeded line Count!!! (%d)\n", fs->line_count);
    }
}

// Emulator calls this once when a frame is complete
// the lines collected from the emulator
// are kept in 3 buffers
// the state of the buffer determines which is drawn on screen
// and which is used to recieve "new" lines.
uint64_t start=0;
IRAM_ATTR void mini_end_frame(void)
{
    static uint64_t emu_last_time   = 0;
    static int      emu_frame_count = 0;
//printf("Frame end");
    // EMU FPS
    // note!
    // this FPS displays how many frame ends were recieved from the emulator in 1 second
    // a frame end emulation wise is NOT a fixed time!
    // a frame end is decided by the vectrex programmer, usually by a call to WaitRecal().
    // Per standard a WaitRecal should be called every 30000 vectrex cycles
    // if that is done - then the FPS shows 50 FPS
    //
    // if the vectrex itself uses more the 30000 cycles per frame - then the framerate drops
    // but this does not mean the emulation is to slow.
    // this only means the frame of the vectrex took longer then 1/50 of a second
    //
    // many games have rounds that are slower then 30000 cycles!
    // -> a frame drop here does NOT mean the emulation is not running in full speed!
    // it rather shows how "fast" or how "good" a vectrex game runs and keeps up with the desired 1/50 per round
    //
    // NOTE:
    // If the emulator runs in "DEFAULT_AUTO_SYNC"
    // then it tries to find a call to WaitRecal or for timer T2 to expire.
    // If both of these options fail - the emulator "automatically" sends a frame end after 50000 cycles
    // if that happends the screen (in the emulation) will flicker!
    // This is mainly due to the fact, that then each displayed framebuffer does not get a full "load" of lines
    // but rather the lines that have been finished since last call!
    // and each of these 50000 cycle frames - have different lines, different count of lines -> flicker.
    uint64_t now = esp_timer_get_time();
    emu_frame_count++;
    int idx = s_build_frame_index;
    frame_slot_t *cur = &s_frames[idx];
    if (now - emu_last_time > 1000000) // has one second passed?
    {
        printf("EMU FPS = %d\n", emu_frame_count);
        emu_frame_count = 0;
        emu_last_time   = now;
    }

    // keyboard / joystick events are "collected" once every round
    // if we ever support a spinner - it might have to be called more often
    void readevents();
    readevents();

    // Aktuellen Slot als READY markieren
    cur->state = FRAME_READY;

