malbanGit/ESP32_P4_Vectrex/main/main.c
    // do not allow ready frame to grow old!
    for (int i = 0; i < NUM_FRAME_SLOTS; ++i) 
    {
        if (s_frames[i].state == FRAME_READY) 
        {
            if (i != s_build_frame_index) s_frames[i].state = FRAME_FREE;
            break;
        }
    }

    // Nächsten Build-Slot wählen:
    // 1) Bevorzugt einen FREE-Slot
    // 2) Wenn kein FREE, dann einen READY-Slot (älteren Frame droppen)
    int next = -1;

    for (int i = 0; i < NUM_FRAME_SLOTS; ++i) {
        int cand = i;
        if (s_frames[cand].state == FRAME_FREE) {
            next = cand;
            break;
        }
    }

    if (next < 0) 
    {
        // printf("No free Render Buffer found!\n");
        for (int i = 0; i < NUM_FRAME_SLOTS; ++i) 
        {
            if (i!=s_build_frame_index)
            {
                int cand = i;
                if (s_frames[cand].state == FRAME_READY) 
                {
                    next = cand;
                    break;
                }
            }
        }
    }

    if (next < 0) {
        // Extrem unwahrscheinlich (alle RENDERING/BUILDING),
        // im Zweifel aktuellen Slot weiterverwenden und Frame droppen.
        next = idx;
        // printf("No free and no ready Render Buffer found!\n");
    }

    frame_slot_t *fs_next = &s_frames[next];
    fs_next->line_count = 0;
    fs_next->hash       = 0;
    fs_next->state      = FRAME_BUILDING;
    s_build_frame_index = next;
}

// ----------------------------------------------------
// Undraw previous contents of a given framebuffer index
// ----------------------------------------------------
// only kept for future easier testing!
// now we do not use the "SIMPLE_UNDRAW" per default anymore - it is much slower!
IRAM_ATTR static inline void undraw_previous_fb(int fb_index)
{
    int count = s_fb_line_count[fb_index];
    for (int i = 0; i < count; ++i) {
        vectrex_line_t *l = &s_fb_lines[fb_index][i];
        undrawLine_raw((int16_t)l->x0, (int16_t)l->y0, (int16_t)l->x1,(int16_t)l->y1, l->brightness);
    }
    s_fb_line_count[fb_index] = 0;
}
IRAM_ATTR static inline void undraw_previous_fb_color(int fb_index)
{
    int count = s_fb_line_count[fb_index];
    for (int i = 0; i < count; ++i) {
        vectrex_line_t *l = &s_fb_lines[fb_index][i];
        undrawLine_raw_color((int16_t)l->x0,(int16_t) l->y0, (int16_t)l->x1, (int16_t)l->y1, l->color, l->brightness);
    }
    s_fb_line_count[fb_index] = 0;
}

// ----------------------------------------------------
// Tasks
// ----------------------------------------------------
#ifdef VECSIM		
int vecsimGame=0; // 0 is vectrex
#define MAX_VECSIM_GAME 8
#endif
IRAM_ATTR static void application_task(void *arg)
{
    while (1) 
    {
#ifdef VECSIM		
        int tempest(void); //ok
        int battlezone(void); //ok
        int blackwidow(void); //ok
        int deluxe(void); // ok
        int asteroids(void); // crashes while playing
        int gravitar(void); //ok
        int lunar(void); // to slow
        int redbaron(void); // ok
        int spaceDuel(void); // ok
        

        if (vecsimGame==1) tempest();
        if (vecsimGame==2) gravitar();
        if (vecsimGame==3) blackwidow();
        if (vecsimGame==4) spaceDuel();
        if (vecsimGame==5) redbaron();
        if (vecsimGame==6) battlezone();
        if (vecsimGame==7) deluxe();
#endif
#ifdef VECTREX
        void vectrex(void);
        vectrex();
#endif		
    }
}

IRAM_ATTR static inline uint32_t line_hash_key(const vectrex_line_t *l)
{
    uint32_t h = (uint32_t)l->x0 * 2654435761u;
    h ^= (uint32_t)l->y0 * 40503u;
    h ^= (uint32_t)l->x1 * 2246822519u;
    h ^= (uint32_t)l->y1 * 3266489917u;
    h ^= (uint32_t)l->brightness+l->color;
    return h;
}
// Hash table for O(n) line matching (open addressing, linear probe)
// Size must be power-of-2 and > MAX_LINE_BUFFER for good load factor
#define MATCH_HT_BITS 11
#define MATCH_HT_SIZE (1 << MATCH_HT_BITS)   // 2048
#define MATCH_HT_MASK (MATCH_HT_SIZE - 1)
DRAM_ATTR static int16_t s_match_ht[MATCH_HT_SIZE]; // -1 = empty, else new-line index

// Renderer: VSYNC-driven, uses last finished emulated frame.
DRAM_ATTR int redraw = 0;
IRAM_ATTR static void renderer_task(void *arg)
{
    // Wait once for first VSYNC
    xSemaphoreTake(s_vsync_sem, portMAX_DELAY);

    uint64_t fps_last_time = esp_timer_get_time();
    int fps_frame_count    = 0;

    for (;;)
    {
        if (s_toggle_display_mode)
        {
            void toggleVideoMode();
            toggleVideoMode();
            s_toggle_display_mode = 0;
            redraw = 3;
        }
        else if (s_toggle_overlay_mode)
        {
            void toggleOverlay();
            toggleOverlay();
            s_toggle_overlay_mode = 0;
            redraw = 3;
        }

        // DISPLAY FPS = number of actually changed frames drawn per second
        // if the drawing keeps up,
        // this is the frequency of the screen refresh - so if it shows 60 on a 60Hz display - everything is good!
        fps_frame_count++;
        uint64_t now = esp_timer_get_time();
        if (now - fps_last_time >= 1000000) 
        {
            printf("DISPLAY FPS = %d\n", fps_frame_count);
            fps_frame_count = 0;
            fps_last_time   = now;
        }

        // Wait for next VSYNC
        xSemaphoreTake(s_vsync_sem, portMAX_DELAY);

        // Einen READY-Slot holen – idealerweise den "neueren".
        int frame_idx  = -1;
        int line_count = 0;


        // 3 "frames" hier stehen nur die Linien - das hat nichts mit den framebuffern zu tun!
        // Hier: letzter READY in der Schleife gewinnt (neuester)
        for (int i = 0; i < NUM_FRAME_SLOTS; ++i) {
            if (s_frames[i].state == FRAME_READY) {
                frame_idx  = i;
                line_count = s_frames[i].line_count;
            }
        }

        // Kein fertiger Frame verfügbar
        if (frame_idx < 0) {
            continue;
        }

        frame_slot_t *fs = &s_frames[frame_idx]; // frame_idx = 0-2
        fs->state = FRAME_RENDERING;
        //printf("Rendering -> %i\n",frame_idx);
        // Use current back framebuffer index
        int fb_idx = s_back_fb_index;           // the current backbuffer - we can write to - it is not displayed!

