malbanGit/ESP32_P4_Vectrex/main/main.c
        }
        else // now color mode = 1
        {
            // simple version
            // undraw all known old lines
            // draw all known new lines
            // regardless whether they are the same or not
            if (redraw>0)
            {
                redraw--;
                undraw_previous_fb_color(fb_idx);             // undraw all from that framebuffer

                // Draw new frame lines into backbuffer and remember them
                // linecount from "frame" (collection of lines)
                for (int i = 0; i < line_count; ++i) {
                    vectrex_line_t *src = &fs->lines[i];

                    drawLine_raw_color(src->x0, src->y0, src->x1, src->y1, src->color, src->brightness);

                    if (s_fb_line_count[fb_idx] < MAX_LINE_BUFFER) {
                        s_fb_lines[fb_idx][s_fb_line_count[fb_idx]++] = *src;
                    }
                    else
                    {
                        printf("-----------------------\n");
                        printf("Line Buffer Exceeded!!!\n");
                        printf("-----------------------\n");
                    }
                }
            }
            else
            {
                // printf("linecount: %i\n", line_count);
                // non simple version
                // check which lines are IDENTICAL to last draw
                // check if any undelete lines interesect
                // undraw all deleted and marked as "dirty lines"
                // draw all lines that are not on the screen already

                // most games have somewhere "steady" lines... this really saves a lot!
                // for cleansweep - this is a party! - A maze full of "fixed" lines!

                // --- Stable/dirty/redraw frame-diff ---
                unsigned int old_count = s_fb_line_count[fb_idx];
                vectrex_line_t *old_lines = s_fb_lines[fb_idx];

                // Step 1: match old lines to new lines — O(n) hash table
                memset(s_match_ht, 0xFF, sizeof(s_match_ht)); // -1 = empty
                for (int j = 0; j < line_count; j++) {
                    uint32_t h = line_hash_key(&fs->lines[j]) & MATCH_HT_MASK;
                    while (s_match_ht[h] != -1) h = (h + 1) & MATCH_HT_MASK;
                    s_match_ht[h] = (int16_t)j;
                }
                memset(s_diff_old_matched, 0, old_count);
                memset(s_diff_new_matched, 0, line_count);
                for (int i = 0; i < old_count; i++) {
                    const vectrex_line_t *ol = &old_lines[i];      /* i*20 computed once */
                    uint32_t h = line_hash_key(ol) & MATCH_HT_MASK;
                    while (s_match_ht[h] != -1) {
                        int j = s_match_ht[h];
                        const vectrex_line_t *nw = &fs->lines[j];  /* j*20 computed once per probe */
                        if (!s_diff_new_matched[j] &&
                            ol->x0 == nw->x0 &&
                            ol->y0 == nw->y0 &&
                            ol->x1 == nw->x1 &&
                            ol->y1 == nw->y1 &&
                            ol->color == nw->color &&
                            ol->brightness == nw->brightness) {
                            s_diff_old_matched[i] = 1;
                            s_diff_new_matched[j] = 1;
                            break;
                        }
                        h = (h + 1) & MATCH_HT_MASK;
                    }
                }

                // Step 2: compute bboxes for dirty (unmatched) old lines
                int dirty_bbox_count = 0;
                for (int i = 0; i < old_count; i++) {
                    if (!s_diff_old_matched[i])
                        s_diff_dirty_bboxes[dirty_bbox_count++] = line_compute_bbox(&old_lines[i]);
                }

                // Step 3: detect stable lines damaged by dirty bbox overlap
                memset(s_diff_damaged, 0, old_count);
                for (int i = 0; i < old_count; i++) {
                    if (!s_diff_old_matched[i]) continue;
                    line_bbox_t sb = line_compute_bbox(&old_lines[i]);
                    for (int d = 0; d < dirty_bbox_count; d++) {
                        if (bboxes_overlap(&sb, &s_diff_dirty_bboxes[d])) {
                            s_diff_damaged[i] = 1;
                            break;
                        }
                    }
                }

                // Step 3b: propagate damage through stable-stable overlaps
                // (undrawing a damaged line erases contributions of overlapping stable lines)
                int propagated = 1;
                while (propagated) {
                    propagated = 0;
                    for (int i = 0; i < old_count; i++) {
                        if (!s_diff_old_matched[i] || !s_diff_damaged[i]) continue;
                        line_bbox_t ab = line_compute_bbox(&old_lines[i]);
                        for (int k = 0; k < old_count; k++) {
                            if (!s_diff_old_matched[k] || s_diff_damaged[k]) continue;
                            line_bbox_t kb = line_compute_bbox(&old_lines[k]);
                            if (bboxes_overlap(&ab, &kb)) {
                                s_diff_damaged[k] = 1;
                                propagated = 1;
                            }
                        }
                    }
                }

                // Steps 4+5a: undraw dirty old lines AND damaged stable lines in one pass
                for (int i = 0; i < old_count; i++) {
                    if (!s_diff_old_matched[i] || s_diff_damaged[i]) {
                        vectrex_line_t *l = &old_lines[i];
                        undrawLine_raw_color(l->x0, l->y0, l->x1, l->y1, l->color, l->brightness);
                    }
                }

                // Step 5b: redraw ALL damaged stable lines
                for (int i = 0; i < old_count; i++) {
                    if (s_diff_old_matched[i] && s_diff_damaged[i]) {
                        vectrex_line_t *l = &old_lines[i];
                        drawLine_raw_color(l->x0, l->y0, l->x1, l->y1, l->color, l->brightness);
                    }
                }

                // Step 6: draw dirty new lines + rebuild s_fb_lines for next frame
                s_fb_line_count[fb_idx] = 0;
                for (int j = 0; j < line_count; j++) {
                    vectrex_line_t *src = &fs->lines[j];
                    if (!s_diff_new_matched[j])
                        drawLine_raw_color(src->x0, src->y0, src->x1, src->y1, src->color, src->brightness);
                    if (s_fb_line_count[fb_idx] < MAX_LINE_BUFFER) {
                        s_fb_lines[fb_idx][s_fb_line_count[fb_idx]++] = *src;
                    } else {
                        printf("-----------------------\n");
                        printf("Line Buffer Exceeded!!!\n");
                        printf("-----------------------\n");
                    }
                }
            }
        }

        // Swap front/back pointers and indices
        uint8_t *tmp_fb = s_fb_front;
        s_fb_front       = s_fb_back;
        s_fb_back        = tmp_fb;

        int tmp_idx      = s_front_fb_index;
        s_front_fb_index = s_back_fb_index;
        s_back_fb_index  = tmp_idx;
        
        // Present new front buffer
        ESP_ERROR_CHECK(esp_lcd_panel_draw_bitmap(
            s_dpi_panel,
            0, 0, LCD_H_RES, LCD_V_RES,
            s_fb_front
        ));

        // Frame-Slot wieder freigeben
        fs->state = FRAME_FREE;
    }
}

// audio task is now running in core 1 with the emulation
// if it ran together with the renderer - interferences occured massively!
// audio task is set to high prio - otherwise the sound can stutter 
// when the emulator is running under full load!
// The audio "write" set the buffer to the "player" logic
// those functions wait till the complete buffer is played
// thus they "wait" for about 1/50 of a second, and then
// request via callback the next sound package from the emulation
//
// the audio callback fills the buffer for exactly 1/50 of a secons
// see audio setup
IRAM_ATTR static void audio_music_task(void *arg)
{
    while (1)
    {
        if (!s_audio_cb) {
            /* Noch kein Codec oder kein Callback gesetzt: kurz warten */
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        if (audio_buf==NULL)
        {
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        s_audio_cb(NULL, (int16_t *) audio_buf, audio_bufsize);

        esp_err_t ret;
        if (mode == VIDEO_OUT_HDMI)
        {
            size_t written = 0;
            ret = i2s_channel_write(s_i2s_tx_chan,
                                    (void *)audio_buf,
                                    audio_bufsize,
                                    &written, portMAX_DELAY);
        }
        else
        {
            ret = esp_codec_dev_write(s_codec_dev, (void *)audio_buf, audio_bufsize);
        }

        if (ret != ESP_OK)
        {
            ESP_LOGE(TAG, "audio_music_task: esp_codec_dev_write failed: 0x%x", ret);
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
}

