malbanGit/ESP32_P4_Vectrex/main/main.c
void setAppFPS(int fps)
{
    g_fpsToReach=  1000000/fps;
}
void initGlobals()
{
    overlayEnabled = ENABLE_OVERLAYS;
    mode = VIDEO_OUT_SELECTED;          // default at boot
    g_color_mode = 0;
    g_fpsToReach=  1000000/MAX_EMU_FPS;

    changeGlobalLineValues( LINE_WIDTH, LINE_GLOW_WIDTH);
}

// ----------------------------------------------------
// app_main
// ----------------------------------------------------
void app_main(void)
{
    initGlobals();
    ESP_LOGI(TAG, "initGlobals() done");
    configure_gpios();
    p3v_en();
    ESP_LOGI(TAG, "configure_gpios() done");
    initADC();
    ESP_LOGI(TAG, "initADC() done");

#if VECX_DEBUG == 1    
    esp_log_level_set("lcd.dsi.dpi", ESP_LOG_DEBUG);   // show the actual DPI pixel clock achieved
    esp_log_level_set("lcd_panel.dpi", ESP_LOG_DEBUG);
    esp_log_level_set("mipi_dsi", ESP_LOG_DEBUG);
    esp_log_level_set("*", ESP_LOG_DEBUG);  

#else    
    /*
    ESP_LOG_NONE — no output at all
    ESP_LOG_ERROR — only errors
    ESP_LOG_WARN — errors and warnings
    ESP_LOG_INFO
    ESP_LOG_DEBUG
    ESP_LOG_VERBOSE
    */
    esp_log_level_set("lcd.dsi.dpi", ESP_LOG_ERROR);   // show the actual DPI pixel clock achieved
    esp_log_level_set("lcd_panel.dpi", ESP_LOG_ERROR);
    esp_log_level_set("mipi_dsi", ESP_LOG_ERROR);
    esp_log_level_set(TAG, ESP_LOG_ERROR);
    esp_log_level_set(TAG_A, ESP_LOG_ERROR);
    esp_log_level_set("*", ESP_LOG_ERROR);  
#endif

    board_assert_vcv_noe();
    board_enable_dsi_phy_power();

    // 1) I2C master bus (same pins/driver as the i2c_tools bring-up project).
    ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_cfg, &i2c_bus));


    if (initSD() != ESP_OK)
    {
        printf("Something went wrong with the SDCard init - did you insert a card?");
    }

    if (usb_keyboard_init() != ESP_OK)
    {
        printf("Something went wrong with the keyboard init - did you connect a keyboard?");
    }
#ifdef BLUETOOTH_ENABLED
bt_init();
#endif
    ESP_LOGI(TAG, "Init LCD / DSI");
    lcd_init();


    ESP_LOGI(TAG, "VIDEO_FB_BPP: %i", VIDEO_FB_BPP);
    ESP_LOGI(TAG, "LCD_H_RES: %i, LCD_V_RES: %i", LCD_H_RES, LCD_V_RES);

    // Logische Frame-Slots initialisieren
    frames_init();


#ifdef CONFIG_ESP_TASK_WDT_EN
    // Task-Watchdog aus (Entwicklung)
    esp_task_wdt_deinit();
#endif

    ESP_ERROR_CHECK(audio_init());

    if (mode == VIDEO_OUT_HDMI)
    {
        gpio_set_level(GPIO_OUTPUT_PA, 0);   // speaker off
        /* enable LT8912B I2S audio input — CEC bank reg 0xB2 */
        uint8_t val = 0x01;
        esp_lcd_panel_io_tx_param(lt_io.cec_dsi, 0xB2, &val, 1);
    }
    else
    {
        // switch off with
        gpio_set_level(GPIO_OUTPUT_PA, 1);   // speaker on
        uint8_t val = 0x00;
        esp_lcd_panel_io_tx_param(lt_io.cec_dsi, 0xB2, &val, 1);
    }

    printf("Audio init done\n");

    xTaskCreatePinnedToCore(
        audio_music_task,        // Task-Funktion
        "audio_music_task",      // Name
        8192,                    // Stackgröße (Wort, nicht Byte)
        NULL,                    // Parameter
        20,                       // Priorität
        &s_audio_task_handle,    // Handle
        1                        // Core 0
    );

    // Emulator task (core 1) — static stack in internal SRAM
    xTaskCreateStaticPinnedToCore(
        application_task,
        "application",
        EMU_STACK_SIZE,
        NULL,
        7,
        s_emu_stack,
        &s_emu_tcb,
        1
    );

    // Renderer task (core 0) — static stack in internal SRAM
    xTaskCreateStaticPinnedToCore(
        renderer_task,
        "renderer",
        REND_STACK_SIZE,
        NULL,
        3,
        s_rend_stack,
        &s_rend_tcb,
        0
    );

#if VECX_DEBUG == 1    
    printf("Free internal DRAM: %d bytes\n", heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    printf("Largest free DRAM block: %d bytes\n", heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));    
    //heap_caps_print_heap_info(MALLOC_CAP_8BIT);
#endif    
}
void toggleVideoModeRequest()
{
    s_toggle_display_mode = 1;   // atomic on 32-bit aligned write on RISC-V
}
void toggleOverlayRequest()
{
    printf("Overlay toggled, from %i\n", overlayEnabled);
    s_toggle_overlay_mode = 1;   // atomic on 32-bit aligned write on RISC-V
}

void toggleOverlay()
{
	if (overlayEnabled) overlayEnabled=0; else overlayEnabled = 1; 
printf("Toggle overlay invoked\n");
    // loading a disable overlay, frees all buffers and does not load...
    if (mode == VIDEO_OUT_HDMI)
        loadOverlayRGB(lastOverlay, HDMI_OVERLAY_WIDTH, HDMI_OVERLAY_HEIGHT);
    else
        loadOverlayRGB(lastOverlay, LCD_OVERLAY_WIDTH, LCD_OVERLAY_HEIGHT);
    fireResizeEvent();
}

void toggleVideoMode()
{
    // shut Down
    lcd_deinit();

    vTaskDelay(pdMS_TO_TICKS(20)); // I never needed this - but doc says after bus reinit - one should wait a bit?

    if (mode == VIDEO_OUT_HDMI)  mode = VIDEO_OUT_LVDS;
    else   mode = VIDEO_OUT_HDMI;

    lcd_init();

    // audio is simply a switch 
    if (mode == VIDEO_OUT_HDMI)
    {
        gpio_set_level(GPIO_OUTPUT_PA, 0);   // speaker off
        /* enable LT8912B I2S audio input — CEC bank reg 0xB2 */
        uint8_t val = 0x01;
        esp_lcd_panel_io_tx_param(lt_io.cec_dsi, 0xB2, &val, 1);

        loadOverlayRGB(lastOverlay, HDMI_OVERLAY_WIDTH, HDMI_OVERLAY_HEIGHT);
        fireResizeEvent();
    }
    else
    {
        // switch off with
        gpio_set_level(GPIO_OUTPUT_PA, 1);   // speaker on
        uint8_t val = 0x00;
        esp_lcd_panel_io_tx_param(lt_io.cec_dsi, 0xB2, &val, 1);
        loadOverlayRGB(lastOverlay, LCD_OVERLAY_WIDTH, LCD_OVERLAY_HEIGHT);
        fireResizeEvent();
    }
}

// physical device reolution
int getScreenWidth()
{
    return (mode == VIDEO_OUT_HDMI) ? LCD_H_RES: LCD_V_RES;
}
int getScreenHeight()
{
    return (mode == VIDEO_OUT_HDMI) ? LCD_V_RES: LCD_H_RES;
}

// actual part of the screen used for display
int getDisplayWidth()
{
   if (mode == VIDEO_OUT_HDMI)
    {
        if (overlayEnabled)
    		return HDMI_IN_OVERLAY_VECX_WIDTH;
        else
            return HDMI_VECX_WIDTH;
    }
    if (overlayEnabled)
        return LCD_IN_OVERLAY_VECX_WIDTH;
    return LCD_VECX_WIDTH;
}
int getDisplayHeight()
{
   if (mode == VIDEO_OUT_HDMI)
    {
        if (overlayEnabled)
    		return HDMI_IN_OVERLAY_VECX_HEIGHT;
        else
            return HDMI_VECX_HEIGHT;
    }
    if (overlayEnabled)
        return LCD_IN_OVERLAY_VECX_HEIGHT;
    return LCD_VECX_HEIGHT;
}


// called during endframe
// input as expected by vectrex
// analog from -128 - +127
// buttons 0 active!
// one byte
// 7654 3210 (bits)
// 2222 1111 (player)
// 4321 4321 (buttons)
IRAM_ATTR void readevents()
{
    // center is default unless pressed!
	g_inputState.j0_x=0;
	g_inputState.j0_y=0;
	g_inputState.j1_x=0;
	g_inputState.j1_y=0;


    // if there is a joystick available - use it, not the keyboard!
    get9PinAnalog(); // ADC Joystick and volume control 
    if (is9PinJoystickAvailable())
    {
        g_inputState.buttonState = getGPIOSwitches(); // GPIO, just the four buttons
        g_inputState.j0_x = get9PinAnalogX(); // values from -128 - +127
        g_inputState.j0_y = get9PinAnalogY();
    }
    else
    {
        if (isUSBJoystickAvailable())
        {
            g_inputState.buttonState = miniUSBButton; // just the four buttons
            g_inputState.j0_x = getUSBAnalogX(); // values from -128 - +127
            g_inputState.j0_y = getUSBAnalogY();
        }
        else
        {
#ifdef BLUETOOTH_ENABLED
            // In your application loop:
            if (isBTJoystickAvailable(0)) 
            {
                g_inputState.buttonState = miniBTButton; 
                g_inputState.j0_x = (int8_t)getBTAnalogX(0);
                g_inputState.j0_y = (int8_t)getBTAnalogY(0);
            }
            else
#endif            
            {
                // attached keyboard (slow due to pulls!)
                // mapping as in Vide
                /* Player 1 */
                if (isKeyDown(HID_KEY_LEFT)) g_inputState.j0_x = -128;
                if (isKeyDown(HID_KEY_RIGHT)) g_inputState.j0_x = 127;
                if (isKeyDown(HID_KEY_UP)) g_inputState.j0_y = 127;
                if (isKeyDown(HID_KEY_DOWN)) g_inputState.j0_y = -128;

                /* Player 1 */
                if (isAsciiDown('a'))
                    g_inputState.buttonState &= ~1;
                else
                    g_inputState.buttonState |= 1;

